<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads balenaEtcher from Github and imports it to FileWave</string>
    <key>Identifier</key>
    <string>com.github.mpstrachan.filewave.Etcher</string>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.andrewvalentine.download.Etcher</string>
    <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>balenaEtcher</string>
        <key>fw_app_bundle_id</key>
        <string>com.github.peshay.filewave.Etcher</string>
        <key>fw_destination_root</key>
        <string>/Applications/balenaEtcher.app</string>
  </dict>
  <key>Process</key>
  <array>
        <dict>
      <key>Arguments</key>
      <dict>
        <key>pkgroot</key>
        <string>%RECIPE_CACHE_DIR%/Applications</string>
        <key>pkgdirs</key>
        <dict>
          <key>Applications</key>
          <string>0775</string>
        </dict>
      </dict>
      <key>Processor</key>
      <string>PkgRootCreator</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
        <string>%pkgroot%/balenaEtcher.app</string>
        <key>source_path</key>
        <string>%pathname%/*.app</string>
      </dict>
      <key>Processor</key>
      <string>Copier</string>
    </dict>
    <dict>
      <key>Arguments</key>
      <dict>
                <key>fw_app_bundle_id</key>
        <string>%fw_app_bundle_id%</string>
        <key>fw_app_version</key>
        <string>%version%</string>
        <key>fw_destination_root</key>
        <string>%fw_destination_root%</string>
        <key>fw_fileset_name</key>
                <string>Etcher (Mac) - %version%</string>
        <key>fw_import_source</key>
        <string>%pkgroot%/balenaEtcher.app</string>
      </dict>
      <key>Processor</key>
      <string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
      </dict>
    </array>
  </dict>
</plist>
